Essence/PacketGeneration/v3/PP/DomainNamesChangedNotification.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ver="http://www.multispeak.org/Version_3.0">
   <soapenv:Header>
      <ver:MultiSpeakMsgHeader Version="?" UserID="?" Pwd="?" AppName="?" AppVersion="?" Company="?" CSUnits="feet" CoordinateSystem="?" Datum="?" SessionID="?" PreviousSessionID="?" ObjectsRemaining="?" LastSent="?" RegistrationID="?" AuditID="?" MessageID="?" TimeStamp="?" BuildString="?"/>
   </soapenv:Header>
   <soapenv:Body>
      <ver:DomainNamesChangedNotification>
         <!--Optional:-->
         <ver:changedDomainNames>
            <!--Zero or more repetitions:-->
            <ver:domainNameChange>
               <!--Optional:-->
               <ver:domainName>?</ver:domainName>
               <!--Optional:-->
               <ver:oldDomainName>?</ver:oldDomainName>
               <ver:action>?</ver:action>
            </ver:domainNameChange>
         </ver:changedDomainNames>
      </ver:DomainNamesChangedNotification>
   </soapenv:Body>
</soapenv:Envelope>